[
  {
    "source": "Cloudflare Blog",
    "title": "The White House AI Action Plan:  a new chapter in U.S. AI policy",
    "url": "https://blog.cloudflare.com/the-white-house-ai-action-plan-a-new-chapter-in-u-s-ai-policy/",
    "published": "Fri, 25 Jul 2025 01:52:00 GMT",
    "summary": "6 min read  On July 23, 2025, the White House unveiled its AI Action Plan (Plan), a significant policy document outlining the current administration's priorities and deliverables in Artificial Intelligence. This plan emerged after the White House received over 10,000 public comments in response to a February 2025 Request for Information (RFI).",
    "topics": [
      "network",
      "infra"
    ]
  },
  {
    "source": "Cloudflare Blog",
    "title": "Serverless Statusphere: a walk through building serverless ATProto applications on Cloudflare’s Developer Platform",
    "url": "https://blog.cloudflare.com/serverless-atproto/",
    "published": "Thu, 24 Jul 2025 13:00:00 GMT",
    "summary": "8 min read  Social media users are tired of losing their identity and data every time a platform shuts down or pivots. In the ATProto ecosystem — short for Authenticated Transfer Protocol — users own their data and identities.",
    "topics": [
      "network",
      "infra"
    ]
  },
  {
    "source": "Tailscale Blog",
    "title": "This month at Tailscale: Tailnet Lock, Control plane IP changes, and headless Windows runners",
    "url": "https://tailscale.com/blog/july-25-product-update",
    "published": "Fri, 25 Jul 2025 13:00:00 GMT",
    "summary": "This month's updates include the general availability of Tailnet Lock, a shift and simplification in Tailscale's control-plane domains, and a fix to GitHub Actions on headless Windows runners. For instructions on how to update to the latest version, visit our update guide.",
    "topics": [
      "devex",
      "networking"
    ]
  },
  {
    "source": "Tailscale Blog",
    "title": "Securely connect private data sources to Grafana Cloud with Tailscale",
    "url": "https://tailscale.com/blog/grafana-integration-secure-data-sources",
    "published": "Thu, 24 Jul 2025 13:00:00 GMT",
    "summary": "Securely connecting your critical internal data sources to monitoring tools is a notoriously tricky task for developer and operations teams. While platforms like Grafana Cloud provide the flexibility and power you need, exposing private data sources to the public internet, and moving that data between agents, SSH tunnels, and proxies, adds complexity and risk.",
    "topics": [
      "devex",
      "networking"
    ]
  }
]