[
  {
    "source": "Cloudflare Blog",
    "title": "Reducing double spend latency from 40 ms to < 1 ms on privacy proxy",
    "url": "https://blog.cloudflare.com/reducing-double-spend-latency-from-40-ms-to-less-than-1-ms-on-privacy-proxy/",
    "published": "Tue, 05 Aug 2025 13:00:00 GMT",
    "summary": "8 min read  One of Cloudflare’s big focus areas is making the Internet faster for end users. Part of the way we do that is by looking at the \"big rocks\" or bottlenecks that might be slowing things down — particularly processes on the critical path.",
    "topics": [
      "network",
      "infra"
    ]
  },
  {
    "source": "Cloudflare Blog",
    "title": "Perplexity is using stealth, undeclared crawlers to evade website no-crawl directives",
    "url": "https://blog.cloudflare.com/perplexity-is-using-stealth-undeclared-crawlers-to-evade-website-no-crawl-directives/",
    "published": "Mon, 04 Aug 2025 13:00:00 GMT",
    "summary": "5 min read  We are observing stealth crawling behavior from Perplexity, an AI-powered answer engine. Although Perplexity initially crawls from their declared user agent, when they are presented with a network block, they appear to obscure their crawling identity in an attempt to circumvent the website’s preferences.",
    "topics": [
      "network",
      "infra"
    ]
  },
  {
    "source": "Cloudflare Blog",
    "title": "Vulnerability disclosure on SSL for SaaS v1 (Managed CNAME)",
    "url": "https://blog.cloudflare.com/vulnerability-disclosure-on-ssl-for-saas-v1-managed-cname/",
    "published": "Fri, 01 Aug 2025 13:00:00 GMT",
    "summary": "4 min read  Earlier this year, a group of external researchers identified and reported a vulnerability in Cloudflare’s SSL for SaaS v1 (Managed CNAME) product offering through Cloudflare’s bug bounty program. We officially deprecated SSL for SaaS v1 in 2021; however, some customers received extensions for extenuating circumstances that prevented them from migrating to SSL for SaaS v2 (Cloudflare for SaaS).",
    "topics": [
      "network",
      "infra"
    ]
  },
  {
    "source": "Tailscale Blog",
    "title": "Tailscale’s visual policy editor is in beta",
    "url": "https://tailscale.com/blog/visual-editor-beta",
    "published": "Tue, 05 Aug 2025 11:30:00 GMT",
    "summary": "Tailscale lets you manage your tailnet’s access permissions, including which users are allowed to connect to which machines, using our powerful HuJSON (JSON for Humans) policy file. However, there may be times you prefer to use web forms instead of working with HuJSON directly.",
    "topics": [
      "devex",
      "networking"
    ]
  },
  {
    "source": "Tailscale Blog",
    "title": "An easy, realistic model for MCP connectivity",
    "url": "https://tailscale.com/blog/model-for-mcp-connectivity-lee-briggs",
    "published": "Mon, 04 Aug 2025 15:00:00 GMT",
    "summary": "You can’t escape it. Everywhere you turn in the tech ecosystem, AI is there.",
    "topics": [
      "devex",
      "networking"
    ]
  },
  {
    "source": "Tailscale Blog",
    "title": "The wonderfully lazy way to SSH into your computers",
    "url": "https://tailscale.com/blog/tailscale-web-ssh-console",
    "published": "Wed, 30 Jul 2025 21:45:00 GMT",
    "summary": "My favorite little feature of Tailscale for personal users is the one that helps me avoid feeling like a dummy. It is a subtly powerful thing, lacking the flash of a Taildrop transfer or Taildrive hack, or the broad benefit of \"All my stuff is securely connected.” But it is still worth telling people about, because nobody enjoys staring at a command line and feeling dumb.",
    "topics": [
      "devex",
      "networking"
    ]
  },
  {
    "source": "TechCrunch AI",
    "title": "Perplexity accused of scraping websites that explicitly blocked AI scraping",
    "url": "https://techcrunch.com/2025/08/04/perplexity-accused-of-scraping-websites-that-explicitly-blocked-ai-scraping/",
    "published": "Mon, 04 Aug 2025 15:41:39 +0000",
    "summary": "AI startup Perplexity is crawling and scraping content from websites that have explicitly indicated they don’t want to be scraped, according to internet infrastructure provider Cloudflare. On Monday, Cloudflare published research saying it observed the AI startup ignore blocks and hide its crawling and scraping activities.",
    "topics": [
      "AI",
      "news"
    ]
  }
]